package main

import "fmt"

func main() {
	// 1. Створити зміну з типом bool без присвоїння значення
	var myBool bool

	// 2. Вивести значення змінної в консоль
	fmt.Println("Змінна myBool до присвоєння значення:", myBool)

	// 3. Присвоїти цій змінній значення
	myBool = true

	// 4. Вивести значення змінної в консоль
	fmt.Println("Змінна myBool після присвоєння значення:", myBool)

	// 5. Створити змінну з типом string і відразу присвоїти їй значення
	myString := "Це рядок"

	// 6. Вивести значення змінної в консоль
	fmt.Println("Змінна myString:", myString)
}
